# Bonus: Temperature Analysis I

In [45]:
import pandas as pd
# from datetime import datetime as dt
import datetime as dt
import scipy.stats as sts
import numpy as np

In [28]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources\hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [29]:
# Convert the date column format from string to datetime
df['date']= pd.to_datetime(df['date'], format='%Y-%m-%d')
df.head()

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [35]:
# Set the date column as the DataFrame index
new_df = df.set_index('date', inplace=False)
new_df.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

In [36]:
# Drop the date column
new_df.reset_index(drop=True, inplace=True)
new_df.head()

       station  prcp  tobs
0  USC00519397  0.08    65
1  USC00519397  0.00    63
2  USC00519397  0.00    74
3  USC00519397  0.00    76
4  USC00519397   NaN    73

### Compare June and December data across all years

In [ ]:
from scipy import stats

In [41]:
# Filter data for June
june_df = df.loc[pd.DatetimeIndex(df['date']).month==6].reset_index()[['date','tobs']]
june_df.head()

        date  tobs
0 2010-06-01    78
1 2010-06-02    76
2 2010-06-03    78
3 2010-06-04    76
4 2010-06-05    77

In [42]:
# Filter data for December
dec_df = df.loc[pd.DatetimeIndex(df['date']).month==12].reset_index()[['date','tobs']]
dec_df.head()

        date  tobs
0 2010-12-01    76
1 2010-12-03    74
2 2010-12-04    74
3 2010-12-06    64
4 2010-12-07    64

In [69]:
# Identify the average temperature for June
avg_temp_june = np.mean(june_df['tobs'])
print(f"The mean temperature in June is {avg_temp_june}")

The mean temperature in June is 74.94411764705882

In [68]:
# Identify the average temperature for December
avg_temp_dec = np.mean(dec_df['tobs'])
print(f"The mean temperature in December is {avg_temp_dec}")

The mean temperature in December is 71.04152933421226

In [76]:
# Create collections of temperature data
june_temp = june_df['tobs'].dropna()
dec_temp = dec_df['tobs'].dropna()

In [77]:
# Run unpaired t-test
sts.ttest_ind(june_temp, dec_temp)

Ttest_indResult(statistic=31.60372399000329, pvalue=3.9025129038616655e-191)

### Analysis

- I used Unpaired t-test because both samples consist of distinct test subjects, it is equivalent to a two-sample t-test. The samples do not even have the same lenght.
- The p value returned 3.9025129038616655e-191 which is lower than any threshold (0.01,0.05,0.10). Thus the null hypothesis is rejected and we argue that temperature in June is significantly different compared to the temperature in December.